Repository: saddamalsalfi/ojs-plum-plugin
Catalog: locale/*/locale.po
Languages: ar, pt_pt

# plugins.generic.plumAnalytics.displayName
source: Plum Analytics Artifact Widget
ar: ودجت أثر PlumX

# plugins.generic.plumAnalytics.description
source: Integrate OJS with PlumX, a subscription-based platform for tracking research impact. Through this plugin, PlumX customers can embed the PlumX Artifact widget on the article abstract view in OJS to demonstrate how each article is utilized, interacted with and talked about around the world through dozens of metrics mined from the open Web. The article requires a DOI for the widget to appear.
ar: تكامل OJS مع منصة PlumX (اشتراك مدفوع) لتتبُّع أثر البحوث. عبر هذه الإضافة يمكن لعملاء PlumX تضمين ودجت "أثر PlumX" في صفحة ملخص المقالة داخل OJS لإبراز كيفية استخدام كل مقالة والتفاعل معها والحديث عنها حول العالم، وذلك عبر عشرات المقاييس المستخلصة من الويب المفتوح. ظهور الودجت يتطلب وجود معرِّف DOI للمقالة.
pt_pt: Integra o OJS com PlumX, uma plataforma baseada em subscrição para rastrear o impacto da pesquisa. Através deste plugin, os clientes da PlumX podem incorporar o widget Artifact PlumX na visão de resumo do artigo no OJS para demonstrar a utilização, interação e comentários de cada artigo, através de dezenas de métricas extraídas da Web aberta. O artigo requer um DOI para o widget aparecer.

# plugins.generic.plumAnalytics.block.displayName
source: Plum Analytics Artifact Widget Block
ar: كتلة ودجت أثر PlumX
pt_pt: Bloco do Widgets dos artigos no Plum Analytics

# plugins.generic.plumAnalytics.manager.settings
source: Settings
ar: الإعدادات
pt_pt: Configurações

# plugins.generic.plumAnalytics.manager.plumAnalyticsSettings
source: Plum Analytics Artifact Widget Settings
ar: إعدادات ودجت أثر PlumX
pt_pt: Configurações do widget dos artigos do Plum Analytics

# plugins.generic.plumAnalytics.manager.settings.description
source: <p>With this plugin enabled, the Plum Analytics Artifact widget will be added to your articles. This requires a service agreement with PlumX: please review the <a href="http://plumanalytics.com/ojs_integration/">information on PlumX and OJS integration</a>. The article's DOI will be used to link to the PlumX artifact metrics. For details and examples of the different widget settings, please see the <a href="https://plu.mx/developers/widgets" target="_blank">PlumX Widget Page</a>.</p>
ar: <p>عند تفعيل هذه الإضافة سيتم إدراج ودجت أثر PlumX في مقالاتك. يتطلب ذلك اتفاقية خدمة مع PlumX؛ يُرجى مراجعة <a href="http://plumanalytics.com/ojs_integration/">معلومات تكامل PlumX مع OJS</a>. سيتم استخدام DOI الخاص بالمقالة لربطها بمقاييس أثر PlumX. للحصول على تفاصيل وأمثلة لإعدادات الودجت المختلفة، يُرجى مراجعة <a href="https://plu.mx/developers/widgets" target="_blank">صفحة ودجات PlumX</a>.</p>
pt_pt: <p>Com este plug-in ativado, o widget de Artigos Plum Analytics será adicionado aos seus artigos. Isso requer um contrato de serviço com o PlumX: leia as <a href="http://plumanalytics.com/ojs_integration/"> informações sobre a integração do PlumX e do OJS </a>. O DOI do artigo será usado para vincular as métricas dos Artigos PlumX. Para detalhes e exemplos das diferentes configurações de widgets, consulte a <a href="https://plu.mx/developers/widgets" target="_blank"> página de widgets do PlumX </a>.</ p>

# plugins.generic.plumAnalytics.manager.settings.widgetType
source: Widget Type
ar: نوع الودجت
pt_pt: Tipo do Widget

# plugins.generic.plumAnalytics.manager.settings.widgetType.plumx-plum-print-popup
source: Pop Up
ar: نافذة منبثقة

# plugins.generic.plumAnalytics.manager.settings.widgetType.plumx-summary
source: Summary
ar: ملخّص
pt_pt: Sumário

# plugins.generic.plumAnalytics.manager.settings.widgetType.plumx-details
source: Details
ar: تفاصيل
pt_pt: Detalhes

# plugins.generic.plumAnalytics.manager.settings.widgetTypeInstructions
source: For details and examples of the different widget types, please see the <a href="https://plu.mx/developers/widgets" target="_blank">PlumX Widgets Page</a>.
ar: للتفاصيل والأمثلة على أنواع الودجات المختلفة، يُرجى مراجعة <a href="https://plu.mx/developers/widgets" target="_blank">صفحة ودجات PlumX</a>.
pt_pt: Para obter detalhes e exemplos dos diferentes tipos de widgets, consulte o <a href="https://plu.mx/developers/widgets" target="_blank">PlumX Widgets Page</a>.

# plugins.generic.plumAnalytics.manager.settings.widgetTypeRequired
source: The Widget Type is required.
ar: نوع الودجت مطلوب.
pt_pt: O Tipo do Widget é obrigatório.

# plugins.generic.plumAnalytics.manager.settings.width
source: Width
ar: العرض
pt_pt: Largura

# plugins.generic.plumAnalytics.manager.settings.widthInvalid
source: The Width is invalid.
ar: قيمة العرض غير صالحة.
pt_pt: A largura é inválida

# plugins.generic.plumAnalytics.manager.settings.popup
source: Popup Alignment
ar: محاذاة النافذة المنبثقة
pt_pt: Alinhamento Popup

# plugins.generic.plumAnalytics.manager.settings.popup.left
source: Left
ar: يسار
pt_pt: Esquerda

# plugins.generic.plumAnalytics.manager.settings.popup.right
source: Right
ar: يمين
pt_pt: Direita

# plugins.generic.plumAnalytics.manager.settings.popup.top
source: Top
ar: أعلى
pt_pt: Topo

# plugins.generic.plumAnalytics.manager.settings.popup.bottom
source: Bottom
ar: أسفل
pt_pt: Inferior

# plugins.generic.plumAnalytics.manager.settings.popup.hidden
source: Hidden
ar: مخفي
pt_pt: Escondido

# plugins.generic.plumAnalytics.manager.settings.hideWhenEmpty
source: Hide When Empty
ar: إخفاء عند عدم وجود بيانات
pt_pt: Escondido quando vazio

# plugins.generic.plumAnalytics.manager.settings.border
source: Show Border
ar: إظهار الإطار
pt_pt: Mostrar Rebordo

# plugins.generic.plumAnalytics.manager.settings.hidePrint
source: Hide the PlumPrint
ar: إخفاء PlumPrint
pt_pt: Esconder o PlumPrint

# plugins.generic.plumAnalytics.manager.settings.orientation
source: Display Orientation
ar: اتجاه العرض
pt_pt: Exibir Orientação

# plugins.generic.plumAnalytics.manager.settings.orientation.vertical
source: Vertical
ar: عمودي

# plugins.generic.plumAnalytics.manager.settings.orientation.horizontal
source: Horizontal
ar: أفقي

# plugins.generic.plumAnalytics.manager.settings.hook
source: Display Widget
ar: موضع العرض
pt_pt: Exibir Widget

# plugins.generic.plumAnalytics.manager.settings.hook.footer
source: In the article's page footer
ar: في تذييل صفحة المقالة
pt_pt: No rodapé da página do artigo

# plugins.generic.plumAnalytics.manager.settings.hook.moreInfo
source: Below the article's abstract
ar: أسفل ملخص المقالة
pt_pt: Abaixo do resumo do artigo

# plugins.generic.plumAnalytics.manager.settings.hook.details
source: Below the article's details
ar: أسفل تفاصيل المقالة
pt_pt: Abaixo dos detalhes do artigo

# plugins.generic.plumAnalytics.manager.settings.hookRequired
source: A location to display the widget required.
ar: يجب اختيار موضع لعرض الودجت.
pt_pt: É obrigatório indicar um local para exibir o widget.

# plugins.generic.plumAnalytics.manager.settings.hookInstructions
source: If selecting the "Plum Analytics Artifact Widget Block", you will also need to add the block to the layout in Setup, and a title for the block may be provided below.
ar: إذا اخترت "Plum Analytics Artifact Widget Block"، فستحتاج أيضًا إلى إضافة الكتلة إلى التخطيط من "الإعداد"، ويمكنك تحديد عنوان للكتلة أدناه.
pt_pt: Se selecionar o "Bloco de Widgets de Artigos do Plum Analytics", será necessário adicionar o bloco ao layout na Configuração; um título para o bloco poderá ser fornecido abaixo.

# plugins.generic.plumAnalytics.manager.settings.htmlPrefix
source: HTML Before
ar: HTML قبل
pt_pt: HTML Depois

# plugins.generic.plumAnalytics.manager.settings.htmlSuffix
source: HTML After
ar: HTML بعد
pt_pt: HTML Antes

# plugins.generic.plumAnalytics.manager.settings.blockTitle
source: Block Title
ar: عنوان الكتلة
pt_pt: Titulo do Bloco
